<?php

// Простое число - натуральное (целое положительное) число, имеющее ровно два различных натуральных делителя — единицу и самого себя.
// Простые способы нахождения начального списка простых чисел вплоть до некоторого значения дают решето Эратосфена, решето Сундарама и решето Аткина.
/*************************************************************
 *  Вывод простых чисел с помощью for
 *************************************************************/
$n=40;
//$n=4000000;
$a=[];
$time = time();
for($i=2;$i<$n;$i++){
    if(!key_exists($i, $a)) $a[$i]=true;
    if($a[$i]==true){
        for($j=0; $i*$i+$j*$i<$n; $j++){
            $a[$i*$i+$j*$i]=false;        
        }
    }
}
ksort($a); // Сортировка по ключу
$time = time()-$time;
print("delta time:{$time}\n");
//print_r([count($a)]);
print_r([count($a),$a]);
unset($a);
//$a=null;
/*************************************************************
 *  Вывод простых чисел с помощью while
 *************************************************************/
//$n=8000000;
$b=[];
$time = time();
//for($i=2;$i<$n;$i++) $a[$i]=$i;
$b = array_fill(2, $n-2, true);
$i=2;
while($i<$n){
    if(key_exists($i, $b)){
        for($j=0; $i*$i+$j*$i<$n; $j++){
            unset($b[$i*$i+$j*$i]);
        }
    }
    $i++;
}
$time = time()-$time;
print("delta time:{$time}\n");
//$b = array_values($b); // Обнуление ключей и переиндексация
//sort($b); // Сортировка и переиндексация
//print_r([count($b)]);
print_r([count($b),$b]);
?>
